# სტრინგ მეთოდები გვეხმარებიან ტექსტურ მონაცემებთან სამუშაოდ.
# upper() ადიდებს ჩვენს მიერ პრინტში დაწერილ სიტყვას მაგ:
print("nikolozi".upper())


# lower() აპატარავებს ჩვენს მიერ პრინტში დაწერილ სიტყვას მაგ:
print("ANDRIA".lower())


# capitalize() მხოლოდ პირველ ასოს ადიდებს მაგ:
print("giorgi".capitalize())


# find()ეძებს იმ ასოსო რომელსაც დავწერთ ფრჩხილებში მაგ:
print("giorgi".find("g"))

# დოტ ნოტაცია იგივე წერტილოვანი ნოტაცია,არის პროგრამირებაში ფართოდ გავრცელებული სინტაქსური წესი.
# split ფუნქცია არის პროგრამირების საშუალება, რომელიც სტრიქონს  ჰყოფს მცირე ნაწილე