# upper() ადიდებს ჩვენს მიერ პრინტში დაწერილ სიტყვას მაგ:
print("nikolozi".upper())


# lower() აპატარავებს ჩვენს მიერ პრინტში დაწერილ სიტყვას მაგ:
print("BARBARE".lower())


# capitalize() მხოლოდ პირველ ასოს ადიდებს მაგ:
print("nikolozi".capitalize())


# find()ეძებს იმ ასოსო რომელსაც დავწერთ ფრჩხილებში მაგ:
print("andria".find("g"))


# len() გვაძლევს იმ ელემენტების რაოდენობას რაც გვაქვს მაგ:
movie = "spider man"
print(len(movie))


# append() გვაძლევს საშუალებას დავამატოთ ელემენტი ჩვენს მიერ შექმნილ list-ში მაგ:
num = [1, 2, 3, 4, 5]

num.append("12234")

print(num)


# insert() გვაძლევს საშუალებას დავამატოთ ელემენტი ჩვენს მიერ შექმნილ list-ში კონკრეტულ ადგილას მაგ:
num = [1, 2, 3, 4, 5]

num.insert(2, "nikolozi")

print(num)


# pop() გვაძლევს საშუალებას წავშალოთ ელემენტი ჩვენს მიერ შექმნილ list-ში მაგ:
num = [1, 2, 3, 4, 5]

num.pop(2)

print(num)



# split() ფუნქცია გამოიყენება სტრიქონის  დასაშლელად
name = "nikolozi"
print(name.split("o"))

# სტრინგის მეთოდები დაამუშავებენ ტექსტს და ყოველთვის აბრუნებენ ახალ სტრინგს ხოლო ლისტის მეთოდები მუშაობენ მონაცემთა სიებთან და ბევრ მათგანს შეუძლია პირდაპირ შეცვალოს თავად სია